app/controllers/friendships_controller.rb

  def search
  	@search = User.search(params[:search])
	@users, @users_count = @search.all, @search.count
---
SELECT * FROM `users` WHERE (users.email LIKE '%bobb%')
SELECT count(*) AS count_all FROM `users` WHERE (users.email LIKE '%bobb%')