app/controllers/friendships_controller.rb

  def index
  	@friendships = Friendship.find_all_by_user_id(current_user.id)

  	#Google map
    @map = GMap.new("friends_map")#name of the html element that will hold the map
    @map.control_init(:large_map_3D => true, :hierarchical_map_type => true)
    @map.set_map_type_init(GMapType::G_SATELLITE_3D_MAP)
    @map.interface_init(:scroll_wheel_zoom => true, :continuous_zoom => true, :info_window => true, :dragging => true)
    @map.enableScrollWhellZoom(true);

	@friendships.each do |friend|
		friend.status = Status.find_last_by_user_id(friend.friend_id)
		if friend.status
			@map.center_zoom_init([friend.status.latitude, friend.status.longitude],10)
			login = User.find(friend.friend_id).login
---
SELECT * FROM `friendships` WHERE (`friendships`.`user_id` = 1) LIMIT 1
SELECT * FROM `friendships`
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def show
  	@friendship = Friendship.find(params[:id])
  	if @friendship.user_id != current_user.id
  		flash[:notice] = "Sorry, you can only check your friends' profiles!"
  		redirect_back_or_default user_friendships_url
  	else
		@last_status = Status.find_last_by_user_id(@friendship.friend_id)
	  	if @last_status.nil?
	  		@last_status = Status.new
	  		@last_status.message = "This user never published a status"
	  		@last_status.latitude = 0
	  		@last_status.longitude = 0
	  	end
	  	#Google map
	    @map = GMap.new("friends_map")#name of the html element that will hold the map
	    @map.control_init(:large_map_3D => true, :hierarchical_map_type => true)
	    @map.set_map_type_init(GMapType::G_SATELLITE_3D_MAP)
	    @map.interface_init(:scroll_wheel_zoom => true, :continuous_zoom => true, :info_window => true, :dragging => true)
	    @map.enableScrollWhellZoom(true);
	    login = User.find(@friendship.friend_id).login
	    @map.center_zoom_init([@last_status.latitude, @last_status.longitude],10)
	    @map.overlay_init(GMarker.new([@last_status.latitude, @last_status.longitude], :title => @last_status.message, :info_window => '<h1>'+login+'</h1><em class="status_message_info">&laquo;'+@last_status.message+'&raquo;</em><br/><span style="color:gray;">updated at '+@last_status.updated_at+'</span>'))
---
SELECT * FROM `friendships` WHERE (`friendships`.`id` = 7)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
UPDATE `users` SET `last_request_at` = '2010-03-26 19:39:26', `perishable_token` = 'E4gfDFtAnaabKX4DwWkJ', `updated_at` = '2010-03-26 19:39:26' WHERE `id` = 1

  def create
	friend = User.find_by_login(params[:friendship][:friend_login])
	if friend
		params[:friendship][:friend_id] = friend.id
		params[:friendship].delete(:friend_login)
		@friendship = Friendship.new(params[:friendship])
		if @friendship.save
---
SELECT * FROM `users` WHERE (`users`.`login` = 'sbooob') LIMIT 1
INSERT INTO `friendships` (`user_id`, `friend_id`, `see_position`, `created_at`, `updated_at`) VALUES(2, 1, 1, '2010-03-26 14:12:58', '2010-03-26 14:12:58')

  def destroy
  	@friendship = Friendship.find(params[:id])
  	@friendship.destroy
---
SELECT * FROM `friendships` WHERE (`friendships`.`id` = 10)
DELETE FROM `friendships` WHERE `id` = 10