app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`login`, `last_name`, `first_name`, `password`, `email`, `gender`, `birthday`, `crypted_password`, `password_salt`, `persistence_token`, `single_access_token`, `perishable_token`, `login_count`, `failed_login_count`, `last_request_at`, `current_login_at`, `last_login_at`, `current_login_ip`, `last_login_ip`, `created_at`, `updated_at`) VALUES('sbooob', 'Bianchi', 'Yohann', NULL, 'sbooob@gmail.com', 1, NULL, 'b719a182eb612cdfdc24c200969968e72bd9820525dd94f2659a393efae2544210ccb8ba1ec3187c3099d8f40d5d8f6c5fffa25f77104ab7acef7c12dd048a36', 'A1lTUE52b3-mQB_1Jj-W', 'e778852cc2d116e3120f17a7244222c016dfa8ab0db0b5ad03048fbea935ad824180a3f2d722ce04da7d327e2d6ffa1a978ef51688bdbeda883a8e27729d17a1', 'nczKvaakgyKWaujyTYKG', 'KbcEnpY5Wa-cj1Ky9f1W', 1, 0, '2010-03-13 17:49:49', '2010-03-13 17:49:49', NULL, '127.0.0.1', NULL, '2010-03-13 17:49:49', '2010-03-13 17:49:49')

  def show
    @user = @current_user
    @status = Status.find_last_by_user_id(@user)
	unless @status
		@status = Status.new
	  	@status.message = "This user never published a status"
	  	@status.latitude = 45.6439
	  	@status.longitude = 5.86805
	  	@status.updated_at = Time.now.to_s(:db)
---
UPDATE `users` SET `last_request_at` = '2010-03-12 12:08:00', `perishable_token` = 'hB0XXcqKrCQmu8yLH-b7', `updated_at` = '2010-03-12 12:08:00' WHERE `id` = 1

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `password_salt` = 'hNAIt9DkE8EQ9qNeMmBe', `crypted_password` = '06cdecfe16bc93caf819adce6abe3cedf0caf9f536d373de513b4cc3d7bf352f9ac47ef5163c5c7507bced36532f374b5c7f25640fa7057d107dc7bffb1acd3c', `persistence_token` = 'c7f9e460e8ba8421670507c200cef16aaad6697a2e2ed382d912075de82202781b433423601b2af26ff6375d9a63681cbc6faf7e4624094ed32a8f7fa3eee89e', `birthday` = '2010-03-02', `perishable_token` = 'GHc7XsSUU468cOVoGb_8', `last_request_at` = '2010-03-28 23:02:03', `login_count` = 30, `last_login_at` = '2010-03-28 23:00:48', `current_login_at` = '2010-03-28 23:02:03', `updated_at` = '2010-03-28 23:02:03' WHERE `id` = 1

  def search
  	@search = User.search(params[:search])
	@users, @users_count = @search.all, @search.count
---
SELECT * FROM `users`
SELECT count(*) AS count_all FROM `users`