app/controllers/user_sessions_controller.rb

SELECT * FROM `users` WHERE (LOWER(`users`.login) = 'sbooob') LIMIT 1
UPDATE `users` SET `login_count` = 2, `failed_login_count` = 0, `last_login_at` = '2010-03-26 13:16:50', `current_login_at` = '2010-03-28 23:08:47', `last_login_ip` = '127.0.0.1', `last_request_at` = '2010-03-28 23:08:47', `perishable_token` = 'eY0iSYCk7Zb0fPmphyqX', `updated_at` = '2010-03-28 23:08:47' WHERE `id` = 2
---
  def create
    @user_session = UserSession.new(params[:user_session])
	print "ip:"
	print request.env["HTTP_X_FORWARDED_FOR"]
    if @user_session.save
      flash[:notice] = "Login successful!"
	  @user = User.find_by_login(@user_session.login)
	  if defined? request.env["HTTP_X_FORWARDED_FOR"] then
		@user.current_login_ip = request.env["HTTP_X_FORWARDED_FOR"]
		@user.save